misc/loadtest.yaml
config:
  phases:
    - duration: 60
      arrivalRate: 100
      name: Loadtest with 100 concurrent requests for 60 seconds
  http:
    timeout: 30
  processor: "./randomName.js"
scenarios:
  - flow:
      - function: "generateRandomName"
      - post:
          url: "/Prod/products"
          json:
            name: "{{ randomName }}"
          capture:
            - json: "$.id"
              as: "productId"
      - get:
          url: "/Prod/products/{{ productId }}"
      - get:
          url: "/Prod/products"
      - delete:
          url: "/Prod/products/{{ productId }}"